//${USERID}C JOB (${JOB_ACCOUNTING_INFO}),'SET TRAN ENABLED',REGION=2M,
//        MSGCLASS=H,CLASS=${JOB_CLASS}
//SDSF      EXEC PGM=SDSF
//ISFOUT    DD SYSOUT=*
//CMDOUT    DD SYSOUT=*
//ISFIN     DD *
  SET CONSOLE ${CICS_CONSOLE}
  /F ${SUBSYSTEM_NAME},CEMT SET TRANSACTION(@{CICS_TRANSACTION}) ENABLED
  PRINT FILE CMDOUT
  ULOG
  PRINT
  PRINT CLOSE
/*