//${USERID}C JOB (),'SET EXT TDQ OPEN',REGION=2M,
//        MSGCLASS=H,CLASS=${JOB_CLASS}
//SDSF      EXEC PGM=SDSF
//ISFOUT    DD SYSOUT=*
//CMDOUT    DD SYSOUT=*
//ISFIN     DD *
  SET CONSOLE ${CICS_CONSOLE}
  /F ${SUBSYSTEM_NAME},CEMT SET TDQ(@{CICS_TDQ}) OPEN
  PRINT FILE CMDOUT
  ULOG
  PRINT
  PRINT CLOSE
 /*