//${USERID}D JOB (${JOB_ACCOUNTING_INFO}),'STA ADDR SPACE',REGION=2M,
//        MSGCLASS=H,CLASS=${JOB_CLASS}
//SDSF      EXEC PGM=SDSF
//ISFOUT    DD SYSOUT=*
//CMDOUT    DD SYSOUT=*
//ISFIN     DD *
  SET CONSOLE BATCH
  /S @{ADDRESS_SPACE}