//${USERID}S JOB (${JOB_ACCOUNTING_INFO}),'EXECUTE IMS CMD',REGION=2M,
//        MSGCLASS=H,CLASS=${JOB_CLASS}
//SPOC      EXEC PGM=CSLUSPOC,PARM=('IMSPLEX=${IMS_PLEX}')
//STEPLIB   DD DISP=SHR,DSN=${IMS_RESLIB}
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD *
  UNLOCK TRAN @{IMS_TRANSACTION}